<map version="freeplane 1.11.1">
<!--To view this file, download free mind mapping software Freeplane from https://www.freeplane.org -->
<node TEXT="ГОСТ Р 56546-2015 &quot;Защита информации. Уязвимости ИС. Классификация уязвимостей ИС&quot;" LOCALIZED_STYLE_REF="AutomaticLayout.level.root" FOLDED="false" ID="ID_1090958577" CREATED="1409300609620" MODIFIED="1684351032243">
<hook NAME="accessories/plugins/AutomaticLayout.properties" VALUE="ALL"/>
<font BOLD="true"/>
<hook NAME="MapStyle" background="#f9f9f8" zoom="0.8">
    <properties show_icon_for_attributes="true" edgeColorConfiguration="#808080ff,#ff0000ff,#0000ffff,#00ff00ff,#ff00ffff,#00ffffff,#7c0000ff,#00007cff,#007c00ff,#7c007cff,#007c7cff,#7c7c00ff" show_note_icons="true" fit_to_viewport="false" associatedTemplateLocation="template:/light_nord_template.mm"/>

<map_styles>
<stylenode LOCALIZED_TEXT="styles.root_node" STYLE="oval" UNIFORM_SHAPE="true" VGAP_QUANTITY="24 pt">
<font SIZE="24"/>
<stylenode LOCALIZED_TEXT="styles.predefined" POSITION="bottom_or_right" STYLE="bubble">
<stylenode LOCALIZED_TEXT="default" ID="ID_506805493" ICON_SIZE="12 pt" FORMAT_AS_HYPERLINK="false" COLOR="#484747" BACKGROUND_COLOR="#efefef" STYLE="bubble" SHAPE_HORIZONTAL_MARGIN="8 pt" SHAPE_VERTICAL_MARGIN="5 pt" BORDER_WIDTH_LIKE_EDGE="false" BORDER_WIDTH="1.9 px" BORDER_COLOR_LIKE_EDGE="false" BORDER_COLOR="#8fbcbb" BORDER_DASH_LIKE_EDGE="true" BORDER_DASH="SOLID">
<arrowlink SHAPE="CUBIC_CURVE" COLOR="#000000" WIDTH="2" TRANSPARENCY="200" DASH="" FONT_SIZE="9" FONT_FAMILY="SansSerif" DESTINATION="ID_506805493" STARTARROW="NONE" ENDARROW="DEFAULT"/>
<font NAME="SansSerif" SIZE="11" BOLD="false" STRIKETHROUGH="false" ITALIC="false"/>
<edge STYLE="bezier" COLOR="#2e3440" WIDTH="3" DASH="SOLID"/>
<richcontent CONTENT-TYPE="plain/auto" TYPE="DETAILS"/>
<richcontent TYPE="NOTE" CONTENT-TYPE="plain/auto"/>
</stylenode>
<stylenode LOCALIZED_TEXT="defaultstyle.details" COLOR="#ffffff" BACKGROUND_COLOR="#2e3440" BORDER_WIDTH_LIKE_EDGE="false" BORDER_WIDTH="1.9 px" BORDER_COLOR_LIKE_EDGE="false" BORDER_COLOR="#f0f0f0" BORDER_DASH_LIKE_EDGE="true">
<font SIZE="11" BOLD="false" ITALIC="false"/>
</stylenode>
<stylenode LOCALIZED_TEXT="defaultstyle.attributes">
<font SIZE="10"/>
</stylenode>
<stylenode LOCALIZED_TEXT="defaultstyle.note" COLOR="#000000" BACKGROUND_COLOR="#f6f9a1" TEXT_ALIGN="LEFT">
<icon BUILTIN="clock2"/>
<font SIZE="10"/>
</stylenode>
<stylenode LOCALIZED_TEXT="defaultstyle.floating">
<edge STYLE="hide_edge"/>
<cloud COLOR="#f0f0f0" SHAPE="ROUND_RECT"/>
</stylenode>
<stylenode LOCALIZED_TEXT="defaultstyle.selection" COLOR="#eceff4" BACKGROUND_COLOR="#bf616a" BORDER_COLOR_LIKE_EDGE="false" BORDER_COLOR="#bf616a"/>
</stylenode>
<stylenode LOCALIZED_TEXT="styles.user-defined" POSITION="bottom_or_right" STYLE="bubble">
<stylenode LOCALIZED_TEXT="styles.important" ID="ID_915433779" BORDER_COLOR="#bf616a">
<icon BUILTIN="yes"/>
<arrowlink COLOR="#bf616a" TRANSPARENCY="255" DESTINATION="ID_915433779"/>
<font NAME="Ubuntu" SIZE="14"/>
<edge COLOR="#bf616a"/>
</stylenode>
</stylenode>
<stylenode LOCALIZED_TEXT="styles.AutomaticLayout" POSITION="bottom_or_right" STYLE="bubble">
<stylenode LOCALIZED_TEXT="AutomaticLayout.level.root" COLOR="#ffffff" BACKGROUND_COLOR="#484747" STYLE="bubble" SHAPE_HORIZONTAL_MARGIN="10 pt" SHAPE_VERTICAL_MARGIN="10 pt">
<font SIZE="18"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,1" COLOR="#eceff4" BACKGROUND_COLOR="#d08770" STYLE="bubble" SHAPE_HORIZONTAL_MARGIN="8 pt" SHAPE_VERTICAL_MARGIN="5 pt">
<font SIZE="16"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,2" COLOR="#3b4252" BACKGROUND_COLOR="#ebcb8b">
<font SIZE="14"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,3" COLOR="#2e3440" BACKGROUND_COLOR="#a3be8c">
<font SIZE="12"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,4" COLOR="#2e3440" BACKGROUND_COLOR="#b48ead">
<font SIZE="11"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,5" COLOR="#e5e9f0" BACKGROUND_COLOR="#5e81ac">
<font SIZE="11"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,6" BACKGROUND_COLOR="#81a1c1">
<font SIZE="10"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,7" BACKGROUND_COLOR="#88c0d0">
<font SIZE="10"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,8" BACKGROUND_COLOR="#8fbcbb">
<font SIZE="10"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,9" BACKGROUND_COLOR="#d8dee9">
<font SIZE="10"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,10" BACKGROUND_COLOR="#e5e9f0">
<font SIZE="9"/>
</stylenode>
</stylenode>
</stylenode>
</map_styles>
</hook>
<node TEXT="Введение" FOLDED="true" POSITION="bottom_or_right" ID="ID_977158692" CREATED="1684353723955" MODIFIED="1684353731169">
<node TEXT="входит в комплекс стандартов, устанавливающих классификацию уязвимостей, правила описания уязвимостей, содержание и порядок выполнения работ по выявлению и оценке уязвимостей информационных систем (ИС)." ID="ID_1762809966" CREATED="1684353738247" MODIFIED="1684353740582"/>
<node TEXT="распространяется на деятельность по защите информации, связанную с выявлением и устранением уязвимостей ИС, при создании и эксплуатации ИС" ID="ID_176755455" CREATED="1684353742621" MODIFIED="1684353752894"/>
<node TEXT="принята классификация уязвимостей ИС исходя из области происхождения уязвимостей, типов недостатков ИС и мест возникновения (проявления) уязвимостей ИС" ID="ID_72371853" CREATED="1684353755543" MODIFIED="1684353762559"/>
</node>
<node TEXT="Область применения" FOLDED="true" POSITION="bottom_or_right" ID="ID_1726002714" CREATED="1684350942717" MODIFIED="1684351429495" HGAP_QUANTITY="23 pt" VSHIFT_QUANTITY="-6 pt">
<node TEXT="устанавливает классификацию уязвимостей информационных систем (ИС)." ID="ID_1257051672" CREATED="1684353593545" MODIFIED="1684353677587"/>
<node TEXT="направлен на совершенствование методического обеспечения определения и описания угроз безопасности информации при проведении работ по защите информации в ИС." ID="ID_372602526" CREATED="1684353686883" MODIFIED="1684353694024"/>
<node TEXT="не распространяется на уязвимости ИС, связанные с утечкой информации по техническим каналам, в том числе уязвимости электронных компонентов технических (аппаратных и аппаратно-программных) средств ИС." ID="ID_572097696" CREATED="1684353646137" MODIFIED="1684353683802"/>
</node>
<node TEXT="Норматичные ссылки" FOLDED="true" POSITION="bottom_or_right" ID="ID_1806590610" CREATED="1684351081423" MODIFIED="1684351432354" HGAP_QUANTITY="20.6 pt" VSHIFT_QUANTITY="-0.6 pt">
<node TEXT="ГОСТ Р 50922 Защита информации. Основные термины и определения" ID="ID_841462847" CREATED="1684353572993" MODIFIED="1684354061709"/>
</node>
<node TEXT="Термины и определения" POSITION="bottom_or_right" ID="ID_732365243" CREATED="1684351083174" MODIFIED="1684351441344" HGAP_QUANTITY="21.2 pt" VSHIFT_QUANTITY="6 pt">
<node FOLDED="true" ID="ID_1033843114" CREATED="1684353194448" MODIFIED="1684354051146"><richcontent TYPE="NODE">

<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>информационная система</b>
    </p>
  </body>
</html>

</richcontent>
<font BOLD="true"/>
<node TEXT="Совокупность содержащейся в базах данных информации и обеспечивающих ее обработку информационных технологий и технических средств" ID="ID_663959615" CREATED="1684353207777" MODIFIED="1684353217037"/>
</node>
<node TEXT="компонент информационной системы" FOLDED="true" ID="ID_1074386597" CREATED="1684353219603" MODIFIED="1684353228717">
<node TEXT="Часть информационной системы, включающая некоторую совокупность информации и обеспечивающих ее обработку отдельных информационных технологий и технических средств" ID="ID_495886075" CREATED="1684353228720" MODIFIED="1684353237336"/>
</node>
<node FOLDED="true" ID="ID_202070644" CREATED="1684353239523" MODIFIED="1684354048890"><richcontent TYPE="NODE">

<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>признак классификации уязвимостей</b>
    </p>
  </body>
</html>

</richcontent>
<font BOLD="false"/>
<node TEXT="Свойство или характеристика уязвимостей, по которым производится классификация" ID="ID_24676210" CREATED="1684353330133" MODIFIED="1684353332016"/>
</node>
<node TEXT="информационная технология [технология обработки (передачи) информации в информационной системе]" FOLDED="true" ID="ID_1781519261" CREATED="1684353319939" MODIFIED="1684353343512">
<node TEXT="Процесс, метод поиска, сбора, хранения, обработки, предоставления, распространения информации и способ осуществления таких процессов и методов" ID="ID_712725046" CREATED="1684353345865" MODIFIED="1684353359255"/>
</node>
<node TEXT="конфигурация информационной системы" FOLDED="true" ID="ID_423355427" CREATED="1684353363417" MODIFIED="1684353371447">
<node TEXT="Взаимосвязанные структурно-функциональные характеристики информационной системы, включающие структуру и состав информационной системы, физические, логические, функциональные и технологические взаимосвязи между компонентами информационной системы, с иными информационными системами и информационно-телекоммуникационными сетями, а также с полномочиями субъектов доступа к объектам доступа информационной системы" ID="ID_351884314" CREATED="1684353371451" MODIFIED="1684353379189"/>
</node>
<node TEXT="угроза безопасности информации" FOLDED="true" ID="ID_596670319" CREATED="1684353381865" MODIFIED="1684353390761">
<node TEXT="Совокупность условий и факторов, создающих потенциальную или реально существующую опасность нарушения безопасности информации" ID="ID_445438508" CREATED="1684353390764" MODIFIED="1684353399169"/>
</node>
<node TEXT="уязвимость" FOLDED="true" ID="ID_1047829320" CREATED="1684353401635" MODIFIED="1684353411457">
<node TEXT="Недостаток (слабость) программного (программно-технического) средства или информационной системы в целом, который(ая) может быть использован(а) для реализации угроз безопасности информации" ID="ID_925128307" CREATED="1684353411460" MODIFIED="1684353419967"/>
</node>
<node TEXT="уязвимость кода" FOLDED="true" ID="ID_1046148827" CREATED="1684353422355" MODIFIED="1684353430081">
<node TEXT="Уязвимость, появившаяся в процессе разработки программного обеспечения" ID="ID_399809107" CREATED="1684353430084" MODIFIED="1684353437698"/>
</node>
<node TEXT="уязвимость конфигурации" FOLDED="true" ID="ID_169128289" CREATED="1684353439423" MODIFIED="1684353446688">
<node TEXT="Уязвимость, появившаяся в процессе задания конфигурации (применения параметров настройки) программного обеспечения и технических средств информационной системы" ID="ID_111744174" CREATED="1684353446692" MODIFIED="1684353454352"/>
</node>
<node TEXT="уязвимость архитектуры" FOLDED="true" ID="ID_588968976" CREATED="1684353456279" MODIFIED="1684353464189">
<node TEXT="Уязвимость, появившаяся в процессе проектирования информационной системы" ID="ID_383801751" CREATED="1684353464192" MODIFIED="1684353470890"/>
</node>
<node TEXT="организационная уязвимость" FOLDED="true" ID="ID_926296952" CREATED="1684353475141" MODIFIED="1684353483103">
<node TEXT="Уязвимость, появившаяся в связи с отсутствием (или недостатками) организационных мер защиты информации в информационной системе и (или) несоблюдением правил эксплуатации системы защиты информации информационной системы, требований организационно-распорядительных документов по защите информации и (или) несвоевременном выполнении соответствующих действий должностным лицом (работником) или подразделением, ответственным за защиту информации" ID="ID_98766100" CREATED="1684353483106" MODIFIED="1684353492128"/>
</node>
<node TEXT="многофакторная уязвимость" FOLDED="true" ID="ID_197373940" CREATED="1684353494665" MODIFIED="1684353506119">
<node TEXT="Уязвимость, появившаяся в результате наличия нескольких недостатков различных типов" ID="ID_1736147678" CREATED="1684353506122" MODIFIED="1684353514165"/>
</node>
<node TEXT="язык программирования" FOLDED="true" ID="ID_455760104" CREATED="1684353516279" MODIFIED="1684353523817">
<node TEXT="Язык, предназначенный для разработки (представления) программного обеспечения" ID="ID_723115726" CREATED="1684353523820" MODIFIED="1684353530747"/>
</node>
<node TEXT="степень опасности уязвимости" FOLDED="true" ID="ID_1349060489" CREATED="1684353532927" MODIFIED="1684353540797">
<node TEXT="Мера (сравнительная величина), характеризующая подверженность информационной системы уязвимости и ее влияние на нарушение свойств безопасности информации (конфиденциальность, целостность, доступность)" ID="ID_1177527351" CREATED="1684353540801" MODIFIED="1684353547580"/>
</node>
</node>
<node TEXT="Основные положения" POSITION="bottom_or_right" ID="ID_1248065361" CREATED="1684351083998" MODIFIED="1684351444155" HGAP_QUANTITY="20.6 pt" VSHIFT_QUANTITY="7.2 pt">
<node TEXT="классификационные признаки" FOLDED="true" ID="ID_186778165" CREATED="1684352915434" MODIFIED="1684353043436">
<node TEXT="область происхождения уязвимости" ID="ID_179931450" CREATED="1684352972431" MODIFIED="1684352975588"/>
<node TEXT="типы недостатков ИС" ID="ID_1624429299" CREATED="1684352977334" MODIFIED="1684352984080"/>
<node TEXT="место возникновения (проявления) уязвимости ИС" ID="ID_1542492432" CREATED="1684352986127" MODIFIED="1684352992674"/>
<node TEXT="Примечание" FOLDED="true" ID="ID_1413839473" CREATED="1684352993977" MODIFIED="1684353002811">
<node TEXT="В качестве уязвимых компонентов ИС рассматриваются общесистемное (общее), прикладное, специальное программное обеспечение (ПО), технические средства, сетевое (коммуникационное, телекоммуникационное) оборудование, средства защиты информации" ID="ID_1960556765" CREATED="1684353007695" MODIFIED="1684353010413"/>
</node>
</node>
<node TEXT="поисковые признаки" ID="ID_17463860" CREATED="1684353018955" MODIFIED="1684353104667">
<node TEXT="основные" FOLDED="true" ID="ID_1165995496" CREATED="1684353106247" MODIFIED="1684353110479">
<node TEXT="наименование операционной системы (ОС) и тип аппаратной платформы" ID="ID_1035104583" CREATED="1684353116442" MODIFIED="1684353118602"/>
<node TEXT="наименование ПО и его версия" ID="ID_1120967989" CREATED="1684353120411" MODIFIED="1684353127971"/>
<node TEXT="степень опасности уязвимости" ID="ID_1482316191" CREATED="1684353129097" MODIFIED="1684353135982"/>
</node>
<node TEXT="дополнительные" FOLDED="true" ID="ID_1925838645" CREATED="1684353140111" MODIFIED="1684353149185">
<node TEXT="языки программирования" ID="ID_273056142" CREATED="1684353149186" MODIFIED="1684353158452"/>
<node TEXT="служба (порт), которая(ый) используется для функционирования ПО" ID="ID_1017058443" CREATED="1684353160169" MODIFIED="1684353167209"/>
</node>
</node>
</node>
<node TEXT="Классификация" POSITION="bottom_or_right" ID="ID_1283645909" CREATED="1684351194965" MODIFIED="1684351449040" HGAP_QUANTITY="20 pt" VSHIFT_QUANTITY="5.4 pt">
<node TEXT="по области происхождения" ID="ID_1818274163" CREATED="1684351561240" MODIFIED="1684351676801">
<node TEXT="уязвимости кода" ID="ID_721511473" CREATED="1684351588294" MODIFIED="1684351596140"/>
<node TEXT="уязвимости конфигурации" ID="ID_345693049" CREATED="1684351600251" MODIFIED="1684351611006"/>
<node TEXT="уязвимости архитектуры" ID="ID_911919187" CREATED="1684351621387" MODIFIED="1684351676801"/>
<node TEXT="организационные уязвимости" ID="ID_1229714693" CREATED="1684351628972" MODIFIED="1684351757876"/>
<node TEXT="многофакторные уязвимости" ID="ID_750865463" CREATED="1684351630546" MODIFIED="1684351658213"/>
<node TEXT="примечание" FOLDED="true" ID="ID_743358628" CREATED="1684351632534" MODIFIED="1684351753991">
<node TEXT="В целях выявления и оценки уязвимостей информационных систем могут выделяться подклассы уязвимостей" ID="ID_1120586549" CREATED="1684351745172" MODIFIED="1684351753989"/>
</node>
</node>
<node TEXT="по типам недостатков ИС" ID="ID_63131027" CREATED="1684351763368" MODIFIED="1684352875963" VSHIFT_QUANTITY="-0.6 pt">
<node TEXT="недостатки, связанные с неправильной настройкой параметров ПО" FOLDED="true" ID="ID_1963378738" CREATED="1684351786974" MODIFIED="1684351809076">
<node TEXT="Неправильная настройка параметров ПО заключается в отсутствии необходимого параметра, присвоении параметру неправильных значений, наличии избыточного числа параметров или неопределенных параметров ПО" ID="ID_503464437" CREATED="1684351813882" MODIFIED="1684351822183"/>
</node>
<node TEXT="недостатки, связанные с неполнотой проверки вводимых (входных) данных" FOLDED="true" ID="ID_771922581" CREATED="1684351831226" MODIFIED="1684351848458">
<node TEXT="Недостаточность проверки вводимых (входных) данных заключается в отсутствии проверки значений, избыточном количестве значений, неопределенности значений вводимых (входных) данных" ID="ID_36991595" CREATED="1684351850284" MODIFIED="1684351858199"/>
</node>
<node TEXT="недостатки, связанные с возможностью прослеживания пути доступа к каталогам" FOLDED="true" ID="ID_1257050667" CREATED="1684351862265" MODIFIED="1684351878987">
<node TEXT="Прослеживание пути доступа к каталогам заключается в отслеживании пути доступа к каталогу (по адресной строке/составному имени) и получении доступа к предыдущему/корневому месту хранения данных" ID="ID_1245389593" CREATED="1684351871090" MODIFIED="1684351892667" HGAP_QUANTITY="23 pt"/>
</node>
<node TEXT="недостатки, связанные с возможностью перехода по ссылкам" FOLDED="true" ID="ID_1616091201" CREATED="1684351896385" MODIFIED="1684351907088">
<node TEXT="Переход по ссылкам связан с возможностью внедрения нарушителем ссылки на сторонние ресурсы, которые могут содержать вредоносный код. Для файловых систем недостатками являются символьные ссылки и возможности прослеживания по ним нахождения ресурса, доступ к которому ограничен" ID="ID_1867163394" CREATED="1684351907092" MODIFIED="1684351916211"/>
</node>
<node TEXT="недостатки, связанные с возможностью внедрения команд ОС" FOLDED="true" ID="ID_1883286627" CREATED="1684351918798" MODIFIED="1684352102842">
<node TEXT="Внедрение команд ОС заключается в возможности выполнения пользователем команд ОС (например, просмотра структуры каталогов, копирование, удаление файлов и другие команды)" ID="ID_1236636493" CREATED="1684352092944" MODIFIED="1684352102840"/>
</node>
<node TEXT="недостатки, связанные с межсайтовым скриптингом (выполнением сценариев)" FOLDED="true" ID="ID_34398646" CREATED="1684352106992" MODIFIED="1684352116635">
<node TEXT="Межсайтовый скриптинг обычно распространен в веб-приложениях и позволяет внедрять код в веб-страницы, которые могут просматривать нелегитимные пользователи. Примерами такого кода являются скрипты, выполняющиеся на стороне пользователя" ID="ID_633799202" CREATED="1684352116641" MODIFIED="1684352123799"/>
</node>
<node TEXT="недостатки, связанные с внедрением интерпретируемых операторов языков программирования или разметки" FOLDED="true" ID="ID_475039875" CREATED="1684352128416" MODIFIED="1684352136306">
<node TEXT="Недостатки связаны с внедрением интерпретируемых операторов языков программирования (например, операции выбора, добавления, удаления и другие) или разметки в исходный код веб-приложения" ID="ID_779186362" CREATED="1684352136310" MODIFIED="1684352144908"/>
</node>
<node TEXT="недостатки, связанные с внедрением произвольного кода" FOLDED="true" ID="ID_799336266" CREATED="1684352150154" MODIFIED="1684352170826">
<node TEXT="Недостатки связаны с внедрением произвольного кода и части кода, которые могут приводить к нарушению процесса выполнения операций" ID="ID_1741328154" CREATED="1684352181521" MODIFIED="1684352183752"/>
</node>
<node TEXT="недостатки, связанные с переполнением буфера памяти" FOLDED="true" ID="ID_1045372102" CREATED="1684352198366" MODIFIED="1684352201760">
<node TEXT="Переполнение буфера возникает в случае, когда ПО осуществляет запись данных за пределами выделенного в памяти буфера. Переполнение буфера обычно возникает из-за неправильной работы с данными, полученными извне, и памятью, при отсутствии защиты со стороны среды программирования и ОС. В результате переполнения буфера могут быть испорчены данные, расположенные следом за буфером или перед ним. Переполнение буфера может вызывать аварийное завершение или зависание ПО. Отдельные виды переполнений буфера (например, переполнение в стековом кадре) позволяют нарушителю выполнить произвольный код от имени ПО и с правами учетной записи, от которой она выполняется" ID="ID_850235132" CREATED="1684352208519" MODIFIED="1684352211543"/>
</node>
<node TEXT="недостатки, связанные с неконтролируемой форматной строкой" FOLDED="true" ID="ID_1916339205" CREATED="1684352216398" MODIFIED="1684352614628" HGAP_QUANTITY="13.4 pt">
<node TEXT="Форматная строка в языках C/C++ является специальным аргументом функции с динамически изменяемым числом параметров. Ее значение в момент вызова функции определяет фактическое количество и типы параметров функции. Ошибки форматной строки потенциально позволяют нарушителю динамически изменять путь исполнения программы, в ряде случаев - внедрять произвольный код" ID="ID_257474683" CREATED="1684352227088" MODIFIED="1684352238048"/>
</node>
<node TEXT="недостатки, связанные с вычислениями" FOLDED="true" ID="ID_783138797" CREATED="1684352271628" MODIFIED="1684352275928">
<node TEXT="К недостаткам, связанным с вычислениями, относятся следующие" FOLDED="true" ID="ID_1310153013" CREATED="1684352275932" MODIFIED="1684352291464">
<node TEXT="некорректный диапазон, когда ПО использует неверное максимальное или минимальное значение, которое отличается от верного на единицу в большую или меньшую сторону" ID="ID_1259341204" CREATED="1684352291468" MODIFIED="1684352299713"/>
<node TEXT="ошибка числа со знаком, когда нарушитель может вводить данные, содержащие отрицательное целое число, которые программа преобразует в положительное нецелое число" ID="ID_1040292435" CREATED="1684352300818" MODIFIED="1684352307781"/>
<node TEXT="ошибка усечения числа, когда часть числа отсекается (например, вследствие явного или неявного преобразования или иных переходов между типами чисел)" ID="ID_1234090619" CREATED="1684352309143" MODIFIED="1684352317897"/>
<node TEXT="ошибка индикации порядка байтов в числах, когда в ПО смешивается порядок обработки битов (например, обратный и прямой порядок битов), что приводит к неверному числу в содержимом, имеющем критическое значение для безопасности" ID="ID_1697283211" CREATED="1684352319041" MODIFIED="1684352327163"/>
</node>
</node>
<node TEXT="недостатки, приводящие к утечке/раскрытию информации ограниченного доступа" FOLDED="true" ID="ID_1481058885" CREATED="1684352381530" MODIFIED="1684352396107">
<node TEXT="Утечка информации - преднамеренное или неумышленное разглашение информации ограниченного доступа (например, существуют утечки информации при генерировании ПО сообщения об ошибке, которое содержит сведения ограниченного доступа). Недостатки, приводящие к утечке/раскрытию информации ограниченного доступа, могут возникать вследствие наличия иных ошибок (например, ошибок, связанных с использованием скриптов)" ID="ID_1506057697" CREATED="1684352397542" MODIFIED="1684352402011"/>
</node>
<node TEXT="недостатки, связанные с управлением полномочиями (учетными данными)" FOLDED="true" ID="ID_607478916" CREATED="1684352404227" MODIFIED="1684352417022">
<node TEXT="К недостаткам, связанным с управлением полномочиями (учетными данными) относятся, например, нарушение политики разграничения доступа, отсутствие необходимых ролей пользователей, ошибки при удалении ненужных учетных данных и другие" ID="ID_1727565513" CREATED="1684352422963" MODIFIED="1684352425004"/>
</node>
<node TEXT="недостатки, связанные с управлением разрешениями, привилегиями и доступом" FOLDED="true" ID="ID_425994050" CREATED="1684352431470" MODIFIED="1684352440579">
<node TEXT="К недостаткам, связанным с управлением разрешениями, привилегиями и доступом, относятся, например, превышение привилегий и полномочий, необоснованное наличие суперпользователей в системе, нарушение политики разграничения доступа и другие" ID="ID_495301254" CREATED="1684352440582" MODIFIED="1684352450562"/>
</node>
<node TEXT="недостатки, связанные с аутентификацией" FOLDED="true" ID="ID_535009005" CREATED="1684352457716" MODIFIED="1684352467215">
<node TEXT="К недостаткам, связанным с аутентификацией, относятся возможность обхода аутентификации, ошибки логики процесса аутентификации, отсутствие запрета множественных неудачных попыток аутентификации, отсутствие требования аутентификации для выполнения критичных функций" ID="ID_257379833" CREATED="1684352467218" MODIFIED="1684352475620"/>
</node>
<node TEXT="недостатки, связанные с криптографическими преобразованиями (недостатки шифрования)" FOLDED="true" ID="ID_45781734" CREATED="1684352479601" MODIFIED="1684352495146">
<node TEXT="К недостаткам, связанным с криптографическими преобразованиями, относятся ошибки хранения информации в незашифрованном виде, ошибки при управлении ключами, использование несертифицированных средств криптографической защиты информации" ID="ID_1313683262" CREATED="1684352495149" MODIFIED="1684352505317"/>
</node>
<node TEXT="недостатки, связанные с подменой межсайтовых запросов" FOLDED="true" ID="ID_295031079" CREATED="1684352513361" MODIFIED="1684352523287">
<node TEXT="Подмена межсайтового запроса заключается в том, что используемое ПО не осуществляет или не может осуществить проверку правильности формирования запроса" ID="ID_1909830709" CREATED="1684352523291" MODIFIED="1684352531917"/>
</node>
<node TEXT="недостатки, приводящие к &quot;состоянию гонки&quot;" FOLDED="true" ID="ID_1636095601" CREATED="1684352540711" MODIFIED="1684352550048">
<node TEXT="&quot;Состояние гонки&quot; - ошибка проектирования многопоточной системы или приложения, при которой функционирование системы или приложения зависит от порядка выполнения части кода. &quot;Состояние гонки&quot; является специфической ошибкой, проявляющейся в случайные моменты времени" ID="ID_1020885932" CREATED="1684352551314" MODIFIED="1684352560965"/>
</node>
<node TEXT="недостатки, связанные с управлением ресурсами" FOLDED="true" ID="ID_1256294597" CREATED="1684352575689" MODIFIED="1684352588303">
<node TEXT="К недостаткам управления ресурсами относятся недостаточность мер освобождения выделенных участков памяти после использования, что приводит к сокращению свободных областей памяти, и отсутствие очистки ресурса и процессов от сведений ограниченного доступа перед повторным использованием и другие;" ID="ID_441546080" CREATED="1684352588308" MODIFIED="1684352590970"/>
</node>
<node TEXT="иные типы недостатков" FOLDED="true" ID="ID_398794695" CREATED="1684352594739" MODIFIED="1684352604147">
<node TEXT="По результатам выявления уязвимостей ИС перечень типов недостатков может дополняться" ID="ID_1056870148" CREATED="1684352604151" MODIFIED="1684352610187"/>
</node>
</node>
<node TEXT="по месту возникновения (проявления)" ID="ID_615416163" CREATED="1684352704455" MODIFIED="1684352871362">
<node TEXT="уязвимости в общесистемном (общем) ПО" FOLDED="true" ID="ID_616566158" CREATED="1684352722952" MODIFIED="1684352730218">
<node TEXT="К уязвимостям в общесистемном (общем) ПО относятся уязвимости ОС (уязвимости файловых систем, уязвимости режимов загрузки, уязвимости, связанные с наличием средств разработки и отладки ПО, уязвимости механизмов управления процессами и другие), уязвимости систем управления базами данных [уязвимости серверной и клиентской частей системы управления базами данных, уязвимости специального инструментария, уязвимости исполняемых объектов баз данных (хранимые процедуры, триггеры) и другие], уязвимости иных типов общесистемного (общего) ПО" ID="ID_629131965" CREATED="1684352730221" MODIFIED="1684352737251"/>
</node>
<node TEXT="уязвимости в прикладном ПО" FOLDED="true" ID="ID_1048866425" CREATED="1684352741204" MODIFIED="1684352748710">
<node TEXT="К уязвимостям в прикладном ПО относятся уязвимости офисных пакетов программ и иных типов прикладного ПО (наличие средств разработки мобильного кода, недостатки механизмов контроля исполнения мобильного кода, ошибки программирования, наличие функциональных возможностей, способных оказать влияние на средства защиты информации, и другие уязвимости)" ID="ID_357988999" CREATED="1684352748712" MODIFIED="1684352756395"/>
</node>
<node TEXT="уязвимости в специальном ПО" FOLDED="true" ID="ID_1130436439" CREATED="1684352759969" MODIFIED="1684352783262">
<node TEXT="К уязвимостям в специальном ПО относятся уязвимости ПО, разработанного для решения специфических задач конкретной ИС (ошибки программирования, наличие функциональных возможностей, способных оказать влияние на средства защиты информации, недостатки механизмов разграничения доступа к объектам специального ПО и другие уязвимости)" ID="ID_1026708965" CREATED="1684352767325" MODIFIED="1684352783260"/>
</node>
<node TEXT="уязвимости в технических средствах" FOLDED="true" ID="ID_240553614" CREATED="1684352786188" MODIFIED="1684352871361">
<node TEXT="К уязвимостям в технических средствах относятся уязвимости ПО технических средств (уязвимости микропрограмм в постоянных запоминающих устройствах, уязвимости микропрограмм в программируемых логических интегральных схемах, уязвимости базовой системы ввода-вывода, уязвимости ПО контроллеров управления, интерфейсов управления и другие уязвимости), иные уязвимости технических средств" ID="ID_751950181" CREATED="1684352794032" MODIFIED="1684352800627"/>
</node>
<node TEXT="уязвимости в портативных технических средствах" FOLDED="true" ID="ID_647025267" CREATED="1684352803795" MODIFIED="1684352810725">
<node TEXT="К уязвимостям в портативных технических средствах относятся уязвимости ОС мобильных (портативных) устройств, уязвимости приложений для получения с мобильного устройства доступа к Интернет-сервисам, уязвимости интерфейсов беспроводного доступа, иные уязвимости портативных технических средств" ID="ID_510917627" CREATED="1684352819791" MODIFIED="1684352823114"/>
</node>
<node TEXT="уязвимости в сетевом (коммуникационном, телекоммуникационном) оборудовании" FOLDED="true" ID="ID_1792177775" CREATED="1684352827234" MODIFIED="1684352843579">
<node TEXT="К уязвимостям в сетевом (коммуникационном, телекоммуникационном) оборудовании относятся уязвимости маршрутизаторов, коммутаторов, концентраторов, мультиплексоров, мостов и телекоммуникационного оборудования иных типов (уязвимости протоколов и сетевых сервисов, уязвимости средств и протоколов управления телекоммуникационным оборудованием, недостатки механизмов управления потоками информации, недостатки механизмов разграничения доступа к функциям управления телекоммуникационным оборудованием, другие уязвимости)" ID="ID_245865189" CREATED="1684352839372" MODIFIED="1684352843576"/>
</node>
<node TEXT="уязвимости в средствах защиты информации" FOLDED="true" ID="ID_397526278" CREATED="1684352848149" MODIFIED="1684352855471">
<node TEXT="К уязвимостям в средствах защиты информации относятся уязвимости в средствах управления доступом, средствах идентификации и аутентификации, средствах контроля целостности, средствах доверенной загрузки, средствах антивирусной защиты, системах обнаружения вторжений, средствах межсетевого экранирования, средствах управления потоками информации, средствах ограничения программной среды, средствах стирания информации и контроля удаления информации, средствах защиты каналов передачи информации, уязвимости в иных средствах защиты информации (ошибки программирования, недостатки, связанные с возможностью обхода, отключения, преодоления функций безопасности, другие уязвимости)" ID="ID_1953910655" CREATED="1684352860457" MODIFIED="1684352863137"/>
</node>
</node>
</node>
<node TEXT="Библиография" FOLDED="true" POSITION="bottom_or_right" ID="ID_473448601" CREATED="1684351507601" MODIFIED="1684351520209" HGAP_QUANTITY="20 pt" VSHIFT_QUANTITY="7.2 pt">
<node TEXT="Федеральный закон Российской Федерации &quot;Об информации, информационных технологиях и о защите информации&quot; от 27 июля 2006 г. N 149-ФЗ" ID="ID_1640276013" CREATED="1684351521967" MODIFIED="1684352681841" HGAP_QUANTITY="14.6 pt"/>
<node TEXT="ментальную карту подготовила студентка БИСО-03-20 Семёнова София" ID="ID_1747632860" CREATED="1684352645814" MODIFIED="1684352682536"/>
</node>
</node>
</map>
